---
title: FilteredElementIdIterator
classe: Autodesk.Revit.DB.FilteredElementIdIterator
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# FilteredElementIdIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId Current { get; }` | `filteredElementIdIterator.Current` | ElementId |
| `Boolean IsValidObject { get; }` | `filteredElementIdIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `filteredElementIdIterator.Dispose()` | Void |
| `ElementId GetCurrent()` | `filteredElementIdIterator.GetCurrent()` | ElementId |
| `Boolean IsDone()` | `filteredElementIdIterator.IsDone()` | Boolean |
| `Boolean MoveNext()` | `filteredElementIdIterator.MoveNext()` | Boolean |
| `Void Reset()` | `filteredElementIdIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```